Actualizaciones graficas 2
